src/Enums/ТипыДокументовГИСМТ/ТипыДокументовГИСМТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДокументовГИСМТ</name>
  <enumValues>
    <name>УПД</name>
  </enumValues>
  <enumValues>
    <name>УКД</name>
  </enumValues>
  <enumValues>
    <name>УПДИсправительный</name>
  </enumValues>
  <enumValues>
    <name>УКДИсправительный</name>
  </enumValues>
  <enumValues>
    <name>ЧекККТ</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПотребление</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/СоответствиеТребованиямГИСМТПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Перед определением параметров интеграции.
// Определяет необходимость встраивания гиперссылки в форме документа
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ВстроитьГиперссылку - Булево
Процедура ПередОпределениемПараметровИнтеграции(Форма, ВстроитьГиперссылку) Экспорт
	
	//++ НЕ ГОСИС
	Если Форма.ИмяФормы = "Документ.ПриобретениеТоваровУслуг.Форма.ФормаДокумента"
		Или Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента"
		Или Форма.ИмяФормы = "Документ.ВозвратТоваровОтКлиента.Форма.ФормаДокумента"
		Или Форма.ИмяФормы = "Документ.ВозвратТоваровПоставщику.Форма.ФормаДокумента"
		Или Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента"
		Или Форма.ИмяФормы = "Документ.КорректировкаПриобретения.Форма.ФормаДокумента" Тогда
		
		ВстроитьГиперссылку = Истина;
		
	КонецЕсли;
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

// При определении параметров интеграции.
// Определяет группу для размещения статуса проверки документа в ГИС МТ
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ПараметрыИнтеграции - Структура:
// * ИмяРеквизитаФормыОбъект - Строка - Имя реквизита объекта в форме
// * РазмещатьЭлементыИнтерфейса - Булево - Размещать элементы интерфейса
// * ИмяРодительскойГруппыФормы - Строка - Имя группы, в которую будет встроена гиперссылка
// * ИмяКомандыСоответствиеТребованиямГИСМТ - Строка - Дата документа
// * ЗапуститьПроверкуДокументаВФоне - Булево - значение константы ИспользоватьФоновуюПроверкуДокументовГИСМТ
// * ИнтервалОбработкиОжидания - Строка - интервал обработки ожидания при фоновой проверке
Процедура ПриОпределенииПараметровИнтеграции(Форма, ПараметрыИнтеграции) Экспорт
	
	//++ НЕ ГОСИС
	
	ПараметрыИнтеграции.ИмяРодительскойГруппыФормы  = "ГруппаСостояниеЭДО";
	ПараметрыИнтеграции.РазмещатьЭлементыИнтерфейса = Истина;
	
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

// При определении реквизитов документа.
// Необходимо заполнить в структуре РеквизитыДокумента из прикладного документа поля:
// Дата, Организация, Контрагент
// Параметры:
//  Документ - ОпределяемыйТип.ПрикладныеДокументыГИСМТ
//  РеквизитыДокумента - Структура:
// * Дата - Дата - Дата документа
// * Организация - Неопределено, ОпределяемыйТип.Организация - Организация
// * Контрагент - Неопределено, ОпределяемыйТип.КонтрагентГосИС - Контрагент
Процедура ПриОпределенииРеквизитовДокумента(Документ, РеквизитыДокумента) Экспорт
	
	//++ НЕ ГОСИС

	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Или ТипЗнч(Документ) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
		Или ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента")
		Или ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
		Или ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаРеализации")
		Или ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
		
		Реквизиты = "Дата, Организация, Контрагент";
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, Реквизиты);
		
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ЗначенияРеквизитов);
		
	КонецЕсли;
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

// При определении типа документа.
// Необходимо заполнить тип документа ГИС МТ
// Параметры:
//  Документ - ОпределяемыйТип.ПрикладныеДокументыГИСМТ
//  ТипДокументаГИСМТ - ПеречислениеСсылка.ТипыДокументовГИСМТ - Тип документа
Процедура ПриОпределенииТипаДокументаГИСМТ(Документ, ТипДокументаГИСМТ) Экспорт
	
	//++ НЕ ГОСИС
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Или ТипЗнч(Документ) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
		Или ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента")
		Или ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		ТипДокументаГИСМТ = Перечисления.ТипыДокументовГИСМТ.УПД;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаРеализации")
		Или ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
		
		ХозяйственнаяОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ВидКорректировки");
		
		Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ИсправлениеОшибок Тогда
			ТипДокументаГИСМТ = Перечисления.ТипыДокументовГИСМТ.УПДИсправительный;
		Иначе
			ТипДокументаГИСМТ = Перечисления.ТипыДокументовГИСМТ.УКД;
		КонецЕсли;
		
	КонецЕсли;
	
	//-- НЕ ГОСИС
	
	Возврат;
	
КонецПроцедуры

// При выполнении отдельных проверок продавца и покупателя.
// Вызывается во время отдельных проверок покупателя и продавца, до формирования УПД
// Параметры:
//  ПараметрыОбработки - см. СоответствиеТребованиямГИСМТ.ИнициализироватьПараметрыОбработки
Процедура ПриВыполненииОтдельныхПроверокПродавцаИПокупателя(ПараметрыОбработки) Экспорт
	
	//++ НЕ ГОСИС
	
	//-- НЕ ГОСИС
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти
